Topic: Challenge Set 9 <br>
Subject: SQL <br>
Date: 10/21/2017 <br>
Name: Kenny Leung <br>
Worked with: -- <br>
Location: sf17_ds8/student_submissions/challenges/09-sql/leung_kenny/challenge_set_9_part_iii_kenny.ipynb

In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect("database.sqlite")
cur = con.cursor()
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cur.fetchall())

[('sqlite_sequence',), ('Player_Attributes',), ('Player',), ('Match',), ('League',), ('Country',), ('Team',), ('Team_Attributes',)]

# Question 1

In [76]:
q1 = pd.read_sql_query("SELECT Team.team_long_name, a.home_goals FROM Team \
                        LEFT OUTER JOIN (SELECT home_team_api_id, SUM(home_team_goal) AS home_goals \
                                        FROM Match \
                                        GROUP BY home_team_api_id) a \
                        ON Team.team_api_id=a.home_team_api_id \
                        ORDER BY home_goals DESC \
                        LIMIT 1", con)
q1

   team_long_name  home_goals
0  Real Madrid CF         505

# Question 2

In [79]:
q2 = pd.read_sql_query("SELECT Team.team_long_name, a.away_goals FROM Team \
                        LEFT OUTER JOIN (SELECT away_team_api_id, SUM(away_team_goal) AS away_goals \
                                        FROM Match \
                                        GROUP BY away_team_api_id) a \
                        ON Team.team_api_id=a.away_team_api_id \
                        ORDER BY away_goals DESC \
                        LIMIT 1", con)
q2

  team_long_name  away_goals
0   FC Barcelona         354

No, FC Barcelona scored the most away game goals.

# Question 3

In [86]:
q3 = pd.read_sql_query("SELECT COUNT(id) AS tie_game FROM Match \
                        WHERE home_team_goal = away_team_goal", con)

In [87]:
q3

   tie_game
0      6596

# Question 4

In [111]:
q4a = pd.read_sql_query("SELECT COUNT(player_name) FROM Player WHERE player_name LIKE '% Smith'", con)
q4a

   COUNT(player_name)
0                  15

In [110]:
q4b = pd.read_sql_query("SELECT COUNT(player_name) FROM Player WHERE player_name LIKE '%Smith'", con)
q4b

   COUNT(player_name)
0                  18

# Question 5

In [133]:
q5a = pd.read_sql_query("SELECT COUNT(id) AS ones FROM MATCH \
                        WHERE home_team_goal=away_team_goal AND home_team_goal=1", con)
q5a

   ones
0  3014

In [134]:
q5b = pd.read_sql_query("SELECT COUNT(id) AS twos FROM MATCH \
                        WHERE home_team_goal=away_team_goal AND home_team_goal=2", con)
q5b

   twos
0  1310

In [135]:
q5c = pd.read_sql_query("SELECT COUNT(id) AS threes FROM MATCH \
                        WHERE home_team_goal=away_team_goal AND home_team_goal=3", con)
q5c

   threes
0     264

The median tie score is 2-2.

# Question 6

In [153]:
q6 = pd.read_sql_query("SELECT preferred_foot, COUNT(preferred_foot) FROM Player_Attributes \
                        GROUP BY preferred_foot", con)

In [154]:
q6

  preferred_foot  COUNT(preferred_foot)
0           None                      0
1           left                  44733
2          right                 138409

In [162]:
print(round(100*44733/(44733+138409),2), '% of players prefer their left foot.')

24.43 % of players prefer their left foot.